In [727]:
import pandas as pd

In [728]:
df = pd.read_excel("../data/total_production.xlsx", sheet_name=None)
df = df["Production"]
print("Result: IMPORT")
display(df.head())

Result: IMPORT

c:\Users\pumah\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\worksheet\_reader.py:329: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

,Total production by all exporting countries,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31
0,In thousand 60kg bags,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Crop year,NaN,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,...,2010/11,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,April group,NaN,40795.2926,42529.5454,46868.2042,40166.7591,39990.3663,29395.9601,44297.8201,39475.8391,...,71811.3709,64395.2131,75895.881,74494.0133,69873.1443,71331.7881,75507.8515,70324.4647,81707.9885,76075.7437

In [729]:
# Renaming column to be more accurate 
df = df.rename({"Total production by all exporting countries": "country"}, axis=1)
# We can also remove the second column `Unnamed: 1` as it provides no relevant information  
df = df.drop(columns="Unnamed: 1")
# Remove rows that have all NaN Values
num_columns = len(df.columns)
df = df.dropna(thresh=num_columns)

# Format country name by removing parenthesis (basically anything that is not part of the main country name)
df["country"] = df["country"].map(lambda x: x.split(" (")[0])

print("Result: RENAME, DROP COLUMNS, DROP NULL ROWS, AND FORMAT COUNTRY NAMES")
print("We can see that we have to remove the first row because row #0 contains the crop year along with the appropriate column names")
display(df.head())

Result: RENAME, DROP COLUMNS, DROP NULL ROWS, AND FORMAT COUNTRY NAMES
We can see that we have to remove the first row because row #0 contains the crop year along with the appropriate column names

,country,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,...,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31
2,Crop year,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,1998/99,...,2010/11,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20
4,April group,40795.2926,42529.5454,46868.2042,40166.7591,39990.3663,29395.9601,44297.8201,39475.8391,50892.4914,...,71811.3709,64395.2131,75895.881,74494.0133,69873.1443,71331.7881,75507.8515,70324.4647,81707.9885,76075.7437
5,Angola,50.345,79.331,77.52,32.608,76.802,62.109,70.925,64.33,85.344,...,34.97,28.715,32.79,34.935,39.405,40.515,44.83,35.006,41.9027,51.8419
6,Bolivia,122.777,103.536,120.235,50.823,116.944,142.485,124.579,140.719,137.985,...,117.2249,131.8354,105.2812,119.9122,99.8766,84.2191,77.9835,83.8112,82.5687,81.2654
7,Brazil,27285.6286,27293.4934,34603.3542,28166.9786,28192.047,18060.2022,29196.743,26148.004,36760.8533,...,55428.4102,48591.8289,55418.0012,54688.9664,53304.7669,52870.5876,56788.1784,52739.8179,65130.7997,58210.7127

In [730]:
year_columns = df.columns[1:] # Get the relevant columns, except the first one (country)
year_row = df.iloc[0][1:].str[:-3] # Get the new column names on row 0 which will be from 1900/91 and beyond

new_columns = dict(zip(year_columns, year_row)) # Create dictionary for mapping current column names to new column names
df = df.rename(columns = new_columns)

# Remove first row that is no longer necessary and was already used to rename the columns
df = df.iloc[1:]

print("Result: RENAME COLUMNS, AND REMOVE FIRST ROW")
display(df.head())

Result: RENAME COLUMNS, AND REMOVE FIRST ROW

,country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
4,April group,40795.2926,42529.5454,46868.2042,40166.7591,39990.3663,29395.9601,44297.8201,39475.8391,50892.4914,...,71811.3709,64395.2131,75895.881,74494.0133,69873.1443,71331.7881,75507.8515,70324.4647,81707.9885,76075.7437
5,Angola,50.345,79.331,77.52,32.608,76.802,62.109,70.925,64.33,85.344,...,34.97,28.715,32.79,34.935,39.405,40.515,44.83,35.006,41.9027,51.8419
6,Bolivia,122.777,103.536,120.235,50.823,116.944,142.485,124.579,140.719,137.985,...,117.2249,131.8354,105.2812,119.9122,99.8766,84.2191,77.9835,83.8112,82.5687,81.2654
7,Brazil,27285.6286,27293.4934,34603.3542,28166.9786,28192.047,18060.2022,29196.743,26148.004,36760.8533,...,55428.4102,48591.8289,55418.0012,54688.9664,53304.7669,52870.5876,56788.1784,52739.8179,65130.7997,58210.7127
8,Burundi,487.393,667.199,620.238,393.354,664.143,433.98,400.969,249.785,491.992,...,352.9776,204.1328,405.9615,163.2177,247.55,269.4576,196.4128,202.1079,204.3391,272.4688

In [731]:
# Remove 'group' from country column value, create list of tuples with country column and edge country that contained group <--> contains index of group edge e.g April group, July group, October group
countries = enumerate(df["country"])

groups = [(i, s.replace(" group", "")) for i, s in countries if (" group"  in s) or "Total" in s]
groups

[(0, 'April'), (15, 'July'), (23, 'October'), (58, 'Total')]

In [732]:
# Slices df for countries based on interval that signifies their group. Returns a new df to concat with global output df
def slice_df(df, groups, index, start, end):
  group_df = pd.DataFrame(df.iloc[start:end])
  group_df["group"] = groups[index][1]
  return group_df

In [733]:
# Second to last index
second_to_last = len(groups) - 1

# Start: start index of group list, End: end index of group list
start, end = None, None

new_df = pd.DataFrame()
for index in range(second_to_last):
  start = groups[index][0] + 1
  end = groups[index + 1][0]
  new_df = pd.concat([new_df, slice_df(df, groups, index, start, end)])


print("Result: CREATE NEW DATAFRAME WITH GROUPS COLUMN")
display(new_df.head())

Result: CREATE NEW DATAFRAME WITH GROUPS COLUMN

,country,1990,1991,1992,1993,1994,1995,1996,1997,1998,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,group
5,Angola,50.345,79.331,77.52,32.608,76.802,62.109,70.925,64.33,85.344,...,28.715,32.79,34.935,39.405,40.515,44.83,35.006,41.9027,51.8419,April
6,Bolivia,122.777,103.536,120.235,50.823,116.944,142.485,124.579,140.719,137.985,...,131.8354,105.2812,119.9122,99.8766,84.2191,77.9835,83.8112,82.5687,81.2654,April
7,Brazil,27285.6286,27293.4934,34603.3542,28166.9786,28192.047,18060.2022,29196.743,26148.004,36760.8533,...,48591.8289,55418.0012,54688.9664,53304.7669,52870.5876,56788.1784,52739.8179,65130.7997,58210.7127,April
8,Burundi,487.393,667.199,620.238,393.354,664.143,433.98,400.969,249.785,491.992,...,204.1328,405.9615,163.2177,247.55,269.4576,196.4128,202.1079,204.3391,272.4688,April
9,Ecuador,1503.815,2123.824,1185.48,2069.007,2375.766,1888.233,1992.914,1190.663,1205.968,...,825.4144,828.1024,665.545,644.0112,644.4926,644.8845,623.5744,496.0001,558.9352,April

In [734]:
# Turn year columns into values e.g 1990, 1991, create new column named "year" that holds column values
df = new_df.melt(id_vars=["country", "group"], var_name="year", value_name="units")

print("Result: CREATE NEW DATAFRAME WITH YEAR, AND UNITS COLUMNS")
display(df)

Result: CREATE NEW DATAFRAME WITH YEAR, AND UNITS COLUMNS

                country    group  year       units
0                Angola    April  1990      50.345
1               Bolivia    April  1990     122.777
2                Brazil    April  1990  27285.6286
3               Burundi    April  1990     487.393
4               Ecuador    April  1990    1503.815
...                 ...      ...   ...         ...
1645  Trinidad & Tobago  October  2019      11.691
1646             Uganda  October  2019    5509.154
1647          Venezuela  October  2019    650.1046
1648           Viet Nam  October  2019  30487.1644
1649              Yemen  October  2019     91.4278

[1650 rows x 4 columns]

In [735]:
# EXPORT CSV FILE
# df.to_csv("../data/total_production_v1.csv", index=False)
# print("Done")